In [1]:
import numpy as np

In [4]:
d = np.ones((3,3,3),dtype=int)

In [5]:
d + 5

array([[[6, 6, 6],
        [6, 6, 6],
        [6, 6, 6]],

       [[6, 6, 6],
        [6, 6, 6],
        [6, 6, 6]],

       [[6, 6, 6],
        [6, 6, 6],
        [6, 6, 6]]])

In [7]:
d = np.arange(10,100,2)

In [9]:
data = np.random.randint(1,100,(10,10))

In [10]:
data

array([[ 9, 50, 23,  4, 86, 67, 46, 32, 81, 22],
       [42,  9, 33, 50, 35, 38, 18,  9, 78, 61],
       [69, 42, 65, 34,  2, 67, 42, 38, 76, 54],
       [97, 69, 10, 81, 87, 46, 73, 91, 67,  9],
       [60, 50, 95, 14, 26, 58, 37, 99,  6, 97],
       [23, 62,  1,  6, 11, 97, 49, 11, 33, 15],
       [53, 51, 96, 60, 35, 53, 28, 30, 81, 86],
       [14, 81, 56, 78, 87, 75, 69, 32, 25, 46],
       [21, 35, 84, 55, 45, 16, 91, 42, 85, 67],
       [35, 63, 68, 27, 42, 85, 84, 79, 52, 25]])

In [14]:
data[3:7,3:7]

array([[81, 87, 46, 73],
       [14, 26, 58, 37],
       [ 6, 11, 97, 49],
       [60, 35, 53, 28]])

In [16]:
a,b,c = np.hsplit(data,[2,5])

In [17]:
a

array([[ 9, 50],
       [42,  9],
       [69, 42],
       [97, 69],
       [60, 50],
       [23, 62],
       [53, 51],
       [14, 81],
       [21, 35],
       [35, 63]])

In [18]:
b

array([[23,  4, 86],
       [33, 50, 35],
       [65, 34,  2],
       [10, 81, 87],
       [95, 14, 26],
       [ 1,  6, 11],
       [96, 60, 35],
       [56, 78, 87],
       [84, 55, 45],
       [68, 27, 42]])

In [19]:
c

array([[67, 46, 32, 81, 22],
       [38, 18,  9, 78, 61],
       [67, 42, 38, 76, 54],
       [46, 73, 91, 67,  9],
       [58, 37, 99,  6, 97],
       [97, 49, 11, 33, 15],
       [53, 28, 30, 81, 86],
       [75, 69, 32, 25, 46],
       [16, 91, 42, 85, 67],
       [85, 84, 79, 52, 25]])

In [21]:
np.hstack([a,b,c])

array([[ 9, 50, 23,  4, 86, 67, 46, 32, 81, 22],
       [42,  9, 33, 50, 35, 38, 18,  9, 78, 61],
       [69, 42, 65, 34,  2, 67, 42, 38, 76, 54],
       [97, 69, 10, 81, 87, 46, 73, 91, 67,  9],
       [60, 50, 95, 14, 26, 58, 37, 99,  6, 97],
       [23, 62,  1,  6, 11, 97, 49, 11, 33, 15],
       [53, 51, 96, 60, 35, 53, 28, 30, 81, 86],
       [14, 81, 56, 78, 87, 75, 69, 32, 25, 46],
       [21, 35, 84, 55, 45, 16, 91, 42, 85, 67],
       [35, 63, 68, 27, 42, 85, 84, 79, 52, 25]])

In [24]:
np.argmax(data,axis=0)

array([3, 7, 6, 3, 3, 5, 8, 4, 8, 4], dtype=int64)

In [31]:
A = np.array([[1,2],[2,4]])
B = np.array([[3,1],[2,7],[5,2],[4,5]])

In [32]:
A.shape

(2, 2)

In [33]:
B.shape

(4, 2)

In [36]:
A.reshape(2,1,2) - B.reshape(1,4,2)

array([[[-2,  1],
        [-1, -5],
        [-4,  0],
        [-3, -3]],

       [[-1,  3],
        [ 0, -3],
        [-3,  2],
        [-2, -1]]])

In [37]:
import pandas as pd

In [38]:
hr_data = pd.read_csv('https://raw.githubusercontent.com/zekelabs/data-science-complete-tutorial/master/Data/HR_comma_sep.csv.txt')

In [40]:
hr_data.head()

,satisfaction_level,last_evaluation,number_project,average_montly_hours,time_spend_company,Work_accident,left,promotion_last_5years,sales,salary
0,0.38,0.53,2,157,3,0,1,0,sales,low
1,0.80,0.86,5,262,6,0,1,0,sales,medium
2,0.11,0.88,7,272,4,0,1,0,sales,medium
3,0.72,0.87,5,223,5,0,1,0,sales,low
4,0.37,0.52,2,159,3,0,1,0,sales,low

In [41]:
hr_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 14999 entries, 0 to 14998
Data columns (total 10 columns):
satisfaction_level       14999 non-null float64
last_evaluation          14999 non-null float64
number_project           14999 non-null int64
average_montly_hours     14999 non-null int64
time_spend_company       14999 non-null int64
Work_accident            14999 non-null int64
left                     14999 non-null int64
promotion_last_5years    14999 non-null int64
sales                    14999 non-null object
salary                   14999 non-null object
dtypes: float64(2), int64(6), object(2)
memory usage: 1.1+ MB

In [42]:
hr_data.salary.value_counts()

low       7316
medium    6446
high      1237
Name: salary, dtype: int64

In [46]:
hr_data[(hr_data.salary == 'high') & (hr_data.satisfaction_level < .1)]

,satisfaction_level,last_evaluation,number_project,average_montly_hours,time_spend_company,Work_accident,left,promotion_last_5years,sales,salary
111,0.09,0.85,6,289,4,0,1,0,hr,high
1749,0.09,0.91,6,243,4,0,1,0,product_mng,high
12111,0.09,0.85,6,289,4,0,1,0,hr,high
14322,0.09,0.85,6,289,4,0,1,0,hr,high

In [48]:
hr_data.groupby('salary').average_montly_hours.mean()

salary
high      199.867421
low       200.996583
medium    201.338349
Name: average_montly_hours, dtype: float64

In [49]:
hr_data['project_status'] = hr_data.number_project.map(lambda t : 'more projects' if t > 4 else 'less projects')

In [51]:
hr_data.left.value_counts()

0    11428
1     3571
Name: left, dtype: int64

In [52]:
df = pd.DataFrame({'s1':[1,2,3,4,5],'s2':[4,5,6,7,8]})

In [53]:
df

   s1  s2
0   1   4
1   2   5
2   3   6
3   4   7
4   5   8

In [54]:
df['ss1'] = df.s1.map(lambda s:s*2)

0     2
1     4
2     6
3     8
4    10
Name: s1, dtype: int64

In [56]:
df

   s1  s2
0   1   4
1   2   5
2   3   6
3   4   7
4   5   8

In [55]:
def func(r):
    if r['s1']%2 == 0:
        return r['s1']+r['s2']
    else:
        return r['s1']
df.apply(func, axis=1)

0     1
1     7
2     3
3    11
4     5
dtype: int64

In [58]:
def func(r):
    if r['satisfaction_level'] < .2:
        return r['number_project']-1
    return r['number_project']

hr_data['number_project'] = hr_data.apply(func,axis=1)

0        2
1        5
2        6
3        5
4        2
5        2
6        5
7        5
8        5
9        2
10       2
11       5
12       4
13       2
14       2
15       2
16       2
17       4
18       2
19       5
20       5
21       2
22       5
23       2
24       2
25       5
26       4
27       2
28       2
29       2
        ..
14969    2
14970    4
14971    2
14972    5
14973    2
14974    2
14975    6
14976    2
14977    4
14978    2
14979    5
14980    5
14981    5
14982    2
14983    5
14984    2
14985    5
14986    4
14987    5
14988    2
14989    2
14990    5
14991    5
14992    2
14993    6
14994    2
14995    2
14996    2
14997    5
14998    2
Length: 14999, dtype: int64

In [59]:
import re

In [76]:
str = 'an example word:ca*!!'

match = re.search(r'word:\w\w.', str)

In [77]:
match.group()

'word:ca*'

In [100]:
match = re.findall(r'\d+', 'iiw98tig3435jdhfjd7676hf')

In [101]:
match

['98', '3435', '7676']